###############################################################################
# Created by write_sdc
# Mon Jul 18 08:37:05 2022
###############################################################################
current_design zeroriscy_multdiv_fast
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 100.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[32]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[33]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_ext_i[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_adder_i[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {div_en_i}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {equal_to_zero}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mult_en_i}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_a_i[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {op_b_i[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {operator_i[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {operator_i[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {signed_mode_i[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {signed_mode_i[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[10]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[11]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[12]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[13]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[14]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[15]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[16]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[17]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[18]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[19]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[20]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[21]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[22]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[23]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[24]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[25]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[26]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[27]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[28]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[29]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[30]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[31]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[32]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[7]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[8]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_a_o[9]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[10]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[11]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[12]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[13]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[14]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[15]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[16]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[17]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[18]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[19]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[20]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[21]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[22]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[23]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[24]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[25]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[26]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[27]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[28]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[29]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[30]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[31]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[32]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[7]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[8]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_operand_b_o[9]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[10]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[11]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[12]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[13]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[14]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[15]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[16]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[17]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[18]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[19]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[20]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[21]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[22]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[23]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[24]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[25]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[26]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[27]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[28]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[29]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[30]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[31]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[7]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[8]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {multdiv_result_o[9]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ready_o}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {ready_o}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[32]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[31]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[30]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[29]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[28]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[27]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[26]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[25]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[24]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[23]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[22]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[21]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[20]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[19]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[18]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[17]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[16]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[15]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[14]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[13]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[12]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[11]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[10]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[9]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[8]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[7]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[6]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[5]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[4]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[3]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[2]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[1]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_a_o[0]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[32]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[31]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[30]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[29]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[28]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[27]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[26]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[25]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[24]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[23]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[22]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[21]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[20]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[19]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[18]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[17]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[16]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[15]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[14]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[13]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[12]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[11]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[10]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[9]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[8]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[7]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[6]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[5]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[4]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[3]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[2]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[1]}]
set_load -pin_load 0.0334 [get_ports {alu_operand_b_o[0]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[31]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[30]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[29]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[28]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[27]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[26]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[25]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[24]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[23]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[22]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[21]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[20]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[19]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[18]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[17]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[16]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[15]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[14]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[13]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[12]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[11]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[10]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[9]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[8]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[7]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[6]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[5]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[4]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[3]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[2]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[1]}]
set_load -pin_load 0.0334 [get_ports {multdiv_result_o[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_en_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {equal_to_zero}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mult_en_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_ext_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_adder_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_a_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {op_b_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {operator_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {operator_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {signed_mode_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {signed_mode_i[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
